In [1]:
import pandas as pd

In [2]:
people_data = {
    "first": ["Sam", "Jack", "Samir", "Arun", "Rajesh", "Naina"],
    "last": ["Das", "Smith", "Khan", "Banerjee", "Oleti", "Sen"],
    "email": ["sam.das@gmail.com", "jack.smith@gmail.com", "samir.khan@gmail.com", "arun.banerjee@gmail.com", "rajesh.oleti@gmail.com", "naina.sen@gmail.com"]
}

In [3]:
df = pd.DataFrame(people_data)

In [4]:
df

    first      last                    email
0     Sam       Das        sam.das@gmail.com
1    Jack     Smith     jack.smith@gmail.com
2   Samir      Khan     samir.khan@gmail.com
3    Arun  Banerjee  arun.banerjee@gmail.com
4  Rajesh     Oleti   rajesh.oleti@gmail.com
5   Naina       Sen      naina.sen@gmail.com

In [7]:
df.sort_values(by='last', ascending=False)

    first      last                    email
1    Jack     Smith     jack.smith@gmail.com
5   Naina       Sen      naina.sen@gmail.com
4  Rajesh     Oleti   rajesh.oleti@gmail.com
2   Samir      Khan     samir.khan@gmail.com
0     Sam       Das        sam.das@gmail.com
3    Arun  Banerjee  arun.banerjee@gmail.com

In [8]:
df.sort_values(by=['last', 'first'], ascending=False)

    first      last                    email
1    Jack     Smith     jack.smith@gmail.com
5   Naina       Sen      naina.sen@gmail.com
4  Rajesh     Oleti   rajesh.oleti@gmail.com
2   Samir      Khan     samir.khan@gmail.com
0     Sam       Das        sam.das@gmail.com
3    Arun  Banerjee  arun.banerjee@gmail.com

In [15]:
df.sort_values(by=['last', 'first'], ascending=[True, True], inplace=True)

In [11]:
df

    first      last                    email
1    Jack     Smith     jack.smith@gmail.com
5   Naina       Sen      naina.sen@gmail.com
4  Rajesh     Oleti   rajesh.oleti@gmail.com
2   Samir      Khan     samir.khan@gmail.com
0     Sam       Das        sam.das@gmail.com
3    Arun  Banerjee  arun.banerjee@gmail.com

In [13]:
df.sort_index()

    first      last                    email
0     Sam       Das        sam.das@gmail.com
1    Jack     Smith     jack.smith@gmail.com
2   Samir      Khan     samir.khan@gmail.com
3    Arun  Banerjee  arun.banerjee@gmail.com
4  Rajesh     Oleti   rajesh.oleti@gmail.com
5   Naina       Sen      naina.sen@gmail.com

In [14]:
df['last'].sort_values()

3    Banerjee
0         Das
2        Khan
4       Oleti
5         Sen
1       Smith
Name: last, dtype: object